_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_УдалениеПомеченныхСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_УдалениеПомеченныхСмет</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_СводнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлаваССРС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазбивкаПоГодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_УдалениеПомеченныхСмет/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокСмет();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСмет()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СМ_СводнаяСмета.Ссылка КАК Смета,
	|	СМ_СводнаяСмета.Стройка КАК Стройка,
	|	СМ_СводнаяСмета.Стройка.Наименование КАК НаименованиеОбъекта
	|ИЗ
	|	Документ.СМ_СводнаяСмета КАК СМ_СводнаяСмета
	|ГДЕ
	|	СМ_СводнаяСмета.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ОбъектнаяСмета.Ссылка КАК Смета,
	|	СМ_ОбъектнаяСмета.Стройка,
	|	СМ_ОбъектнаяСмета.Стройка.Наименование
	|ИЗ
	|	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета
	|ГДЕ
	|	СМ_ОбъектнаяСмета.ПометкаУдаления И 
	|   (СМ_ОбъектнаяСмета.ИДРодителя = Значение(Документ.СМ_СводнаяСмета.ПустаяСсылка) ИЛИ
	|    СМ_ОбъектнаяСмета.ИДРодителя = Неопределено)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ЛокальнаяСмета.Ссылка КАК Смета,
	|	СМ_ЛокальнаяСмета.Стройка,
	|	СМ_ЛокальнаяСмета.Стройка.Наименование	
	|ИЗ
	|	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	|ГДЕ
	|	СМ_ЛокальнаяСмета.ПометкаУдаления И
	|	(СМ_ЛокальнаяСмета.ИДРодителя = Значение(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка) ИЛИ
	|	СМ_ЛокальнаяСмета.ИДРодителя = Значение(Документ.СМ_СводнаяСмета.ПустаяСсылка) ИЛИ
	|   СМ_ЛокальнаяСмета.ИДРодителя = Неопределено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеОбъекта	
	|";
	
	ТаблицаСмет.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
    
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 
			ПараметрыОбработчика.ТекущийИнтервал, Истина);
		КонецЕсли;
	Исключение   
		
	КонецПопытки;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания); 
	
КонецФункции
 
&НаКлиенте
Процедура Удалить(Команда)
    
  ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
  
  ФоновоеЗадание = Ложь;
  ВыполнитьФоновоеЗаданиеНаСервере(АдресХранилища, ФоновоеЗадание);
  Если ФоновоеЗадание Тогда
	  ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
	  ПодключитьОбработчикОжидания("ФоновоеЗаданиеНаКлиенте", 1, Истина);
	  ПараметрыОбработчика.МаксимальныйИнтервал = 5;
	  ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
  Иначе
	  ТабДок = ПолучитьИзВременногоХранилища(АдресХранилища);
	  Если Не ТабДок = Неопределено Тогда
		  ТабДок.Защита = Истина;
		  ТабДок.ОтображатьЗаголовки = Ложь;
		  ТабДок.ОтображатьСетку = Ложь;
		  ТабДок.АвтоМасштаб = Истина;
		  ТабДок.Показать("Ошибки удаления смет.");
	  КонецЕсли;
  КонецЕсли;
  
КонецПроцедуры

&НаСервере
Процедура ВыполнитьФоновоеЗаданиеНаСервере(АдресХранилища,ФоновоеЗадание = Ложь)
	
	МассивСтрок = ТаблицаСмет.НайтиСтроки(Новый Структура("Пометка",Истина));
	ПомеченныеОбъекты = ТаблицаСмет.Выгрузить(МассивСтрок,"Смета").ВыгрузитьКолонку("Смета");

	СтруктураПараметров = Новый Структура;    
	СтруктураПараметров.Вставить("ТаблицаСмет", ПомеченныеОбъекты);

	// ***************************************************************
	//АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	//Обработки.СМ_УдалениеПомеченныхСмет.УдалениеПомеченныхОбъектов(СтруктураПараметров, АдресХранилища);
	// ****************************************************************
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.СМ_УдалениеПомеченныхСмет.УдалениеПомеченныхОбъектов", 
	СтруктураПараметров, 
	НСтр("ru = 'Удаление помеченных смет и связанных данных'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		АдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		ОбновитьСписокСмет();
	Иначе
		ФоновоеЗадание = Истина;
		ИдентификаторЗадания  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		АдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеНаКлиенте()
	
	Результат = ФоновоеЗаданиеПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		
		ОбновитьСписокСмет();
		ТабДок = ПолучитьИзВременногоХранилища(АдресХранилища);
		Если Не ТабДок = Неопределено Тогда
			ТабДок.Защита = Истина;
			ТабДок.ОтображатьЗаголовки = Ложь;
			ТабДок.ОтображатьСетку = Ложь;
			ТабДок.АвтоМасштаб = Истина;
			ТабДок.Показать("Ошибки удаления смет.");
		КонецЕсли;

	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеПолучитьРезультат()
	
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СнятьФлаги(Команда)
	СнятьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьНаСервере()
	ТЗ = РеквизитФормыВЗначение("ТаблицаСмет");
	ТЗ.ЗаполнитьЗначения(Ложь,"Пометка");
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаСмет");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	 УстановитьНаСервере()
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	ТЗ = РеквизитФормыВЗначение("ТаблицаСмет");
	ТЗ.ЗаполнитьЗначения(Истина,"Пометка");
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаСмет");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСметВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекДанные.Смета);
		Форма = ПолучитьФорму("Документ.СМ_ЛокальнаяСмета.ФормаОбъекта", СтруктураПараметров);
		Форма.Открыть();
	ИначеЕсли ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекДанные.Смета);
		Форма = ПолучитьФорму("Документ.СМ_ОбъектнаяСмета.ФормаОбъекта", СтруктураПараметров);
		Форма.Открыть();
	ИначеЕсли ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекДанные.Смета);
		Форма = ПолучитьФорму("Документ.СМ_СводнаяСмета.ФормаОбъекта", СтруктураПараметров);
		Форма.Открыть();
	КонецЕсли;	
				
КонецПроцедуры

#КонецОбласти
